wmqScalaTest/in.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:int="urn:EEC:Interaction:v1.0" xmlns:wsa="http://www.w3.org/2005/08/addressing">
	<soap:Header>
		<wsa:MessageID>urn:uuid:${__UUID}</wsa:MessageID>
		<wsa:To>EAEU://EEC/CP/P.MM.01/P.ACT.001</wsa:To>
		<wsa:ReplyTo>
			<wsa:Address>EAEU://BY/CP/P.MM.01/P.MM.01.ACT.001</wsa:Address>
		</wsa:ReplyTo>
		<wsa:Action>int://CP/P.MM.01/0.1/P.MM.01.PRC.004/P.MM.01.TRN.004/P.MM.01.MSG.005</wsa:Action>
		<int:ProcedureID>urn:uuid:${__UUID}</int:ProcedureID>
		<int:ConversationID>urn:uuid:${__UUID}</int:ConversationID>
	</soap:Header>
	<soap:Body><doc:ResourceStatusDetails xsi:schemaLocation="urn:EEC:R:ResourceStatusDetails:v0.4.2 EEC_R_ResourceStatusDetails_v0.4.2.xsd" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:ccdo="urn:EEC:M:ComplexDataObjects:v0.4.2" xmlns:csdo="urn:EEC:M:SimpleDataObjects:v0.4.2" xmlns:doc="urn:EEC:R:ResourceStatusDetails:v0.4.2">
		<ccdo:EDocHeader>
			<csdo:InfEnvelopeCode>P.MM.01.MSG.005</csdo:InfEnvelopeCode>
			<csdo:EDocCode>R.007</csdo:EDocCode>
			<csdo:EDocId>${__UUID}</csdo:EDocId>
			<csdo:EDocDateTime>2015-01-10T09:30:47Z</csdo:EDocDateTime>
		</ccdo:EDocHeader>
	</doc:ResourceStatusDetails>
	</soap:Body>
</soap:Envelope>